snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/ОтложенныеДвиженияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеДвиженияДокументов</name>
  <resources>
    <name>Движения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>КоличествоЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Добавлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаВыполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.УстановкаСтатусаКМ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/RecordSetModule.bsl
Функция СохранитьДвижения(ДокСсылка, Движения) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда 
		Результат.Ошибки.Добавить("Не указан регистратор !");
		Возврат Результат;
	КонецЕсли;	
	
	Если НЕ Метаданные.РегистрыСведений.ОтложенныеДвиженияДокументов.Измерения.ДокСсылка.Тип.СодержитТип(ТипЗнч(ДокСсылка)) Тогда 
		ТекстОшибки = СтрШаблон("Движения документа: %1 не подлежат отложенной записи.", ТипЗнч(ДокСсылка));
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
	
	Для Каждого КиЗ Из Движения Цикл           
		Запись = НЗ.Добавить();
		
		Запись.ДокСсылка	= ДокСсылка;
		Запись.ИмяРегистра	= КиЗ.Ключ;
		Запись.Движения		= КиЗ.Значение;		
	КонецЦикла;                        
	
	Попытка
		НЗ.Записать();
		Результат.Успешно = Истина;
	Исключение                     
		Результат.Ошибки.Добавить("Ошибка записи отложенных движений документа ! " + ОписаниеОшибки());				
	КонецПопытки;	
	
	Возврат Результат;
КонецФункции //СохранитьДвижения(ДокСсылка, Движения) Экспорт
